In [96]:
import pandas as pd
import numpy as np

In [97]:
data={'Name':['suku','saji','shaaji','soman'],
    'Age':[22,23,22,23],
    'Dprtmnt':['Maths','Botony','History','English'],
    'Wieght':[65,66,70,77],
    'Height':[166,167,177,180]}

In [98]:
df=pd.DataFrame(data)

In [99]:
df

     Name  Age  Dprtmnt  Wieght  Height
0    suku   22    Maths      65     166
1    saji   23   Botony      66     167
2  shaaji   22  History      70     177
3   soman   23  English      77     180

In [100]:
#CONVERTING DATAFRAME TO CSV

In [101]:
df.to_csv('datasci1.csv',encoding='utf-8')

In [52]:
#CONVERTING DATAFRAME TO JSON FILE

In [53]:
df.to_json('data2.json',orient="index")

In [54]:
#converting dataframe to excel file

In [82]:
df.to_excel(r"C:\Users\SREEHARI CR\data science\data3.xlsx", index = False)

In [83]:
df.to_csv(r'C:\Users\SREEHARI CR\data science\data4.txt', header=None, index=None, sep='\t', mode='a')

In [77]:
df=pd.read_csv("data.csv")

In [69]:
df

   Unnamed: 0    suku  22    Maths  65  166
0           0    saji  23   Botony  66  167
1           1  shaaji  22  History  70  177
2           2   soman  23  English  77  180

In [58]:
df.head()

     suku  22    Maths  65  166
0    saji  23   Botony  66  167
1  shaaji  22  History  70  177
2   soman  23  English  77  180

In [70]:
df1=pd.read_json('data2.json')

In [71]:
df1

             0       1        2        3
Name      suku    saji   shaaji    soman
Age         22      23       22       23
Dprtmnt  Maths  Botony  History  English
Wieght      65      66       70       77
Height     166     167      177      180

In [72]:
df1.head()

             0       1        2        3
Name      suku    saji   shaaji    soman
Age         22      23       22       23
Dprtmnt  Maths  Botony  History  English
Wieght      65      66       70       77
Height     166     167      177      180

In [91]:
df2=pd.read_excel("data3.xlsx")

In [92]:
df2

   Unnamed: 0    suku  22    Maths  65  166
0           0    saji  23   Botony  66  167
1           1  shaaji  22  History  70  177
2           2   soman  23  English  77  180

In [93]:
df3=pd.read_table("data4.txt")

In [94]:
df3

   0    saji  23   Botony  66  167
0  1  shaaji  22  History  70  177
1  2   soman  23  English  77  180

In [102]:
df=pd.read_csv("datasci1.csv")

In [103]:
df

   Unnamed: 0    Name  Age  Dprtmnt  Wieght  Height
0           0    suku   22    Maths      65     166
1           1    saji   23   Botony      66     167
2           2  shaaji   22  History      70     177
3           3   soman   23  English      77     180

In [105]:
df.Age.value_counts()

22    2
23    2
Name: Age, dtype: int64

In [111]:
df

   Unnamed: 0    Name  Age  Dprtmnt  Wieght  Height
0           0    suku   22    Maths      65     166
1           1    saji   23   Botony      66     167
2           2  shaaji   22  History      70     177
3           3   soman   23  English      77     180

In [114]:
data=np.append(df, [['saji'],[40],['phy'],[55],[177]])

In [115]:
data

array([0, 'suku', 22, 'Maths', 65, 166, 1, 'saji', 23, 'Botony', 66, 167,
       2, 'shaaji', 22, 'History', 70, 177, 3, 'soman', 23, 'English', 77,
       180, 'saji', '40', 'phy', '55', '177'], dtype=object)